---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AllModelInstanceComments
source: html/4f278c79-4d2d-5950-9245-fd421f8baa25.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AllModelInstanceComments Property

"Comments"

## Syntax (C#)
```csharp
public static ForgeTypeId AllModelInstanceComments { get; }
```